In [1]:
import pandas as pd

In [2]:
df = pd.read_csv('titanic_s.csv')
df.head()

,Survived,Pclass,Name,Sex,Age,Siblings/Spouses Aboard,Parents/Children Aboard,Fare
0,0,3,Mr. Owen Harris Braund,male,22.0,1,0,7.2500
1,1,1,Mrs. John Bradley (Florence Briggs Thayer) Cum...,female,38.0,1,0,71.2833
2,1,3,Miss. Laina Heikkinen,female,26.0,0,0,7.9250
3,1,1,Mrs. Jacques Heath (Lily May Peel) Futrelle,female,35.0,1,0,53.1000
4,0,3,Mr. William Henry Allen,male,35.0,0,0,8.0500

In [3]:
#Используя chunksize, подсчитайте общее количество строк в датасете.
chunk_size = 1000
chunks = pd.read_csv('titanic_s.csv', chunksize=chunk_size)


total_count = 0
for chunk in chunks:
    total_count += len(chunk)

print(f"Общий объем датасета: {total_count}")

Общий объем датасета: 887

In [ ]:
#Сколько пассажиров выжило (Survived = 1) на всем корабле? Используйте чтение данных чанками (chunksize = 100).

In [4]:
#Найдите средний возраст всех пассажиров. Округлите результат до одного знака после запятой. Используйте chunksize.
chunk_size = 100
chunks = pd.read_csv('titanic_s.csv', chunksize=chunk_size)
total_age = 0
total_count = 0
for chunk in chunks:
    total_age += chunk['Age'].sum()
    total_count+= chunk['Age'].count()
average = round(total_age / total_count,1)
print(average)

29.5

In [5]:
#Подсчитайте, сколько пассажиров имеют возраст старше 50 лет (Age > 50).
chunk_size = 100
chunks = pd.read_csv('titanic_s.csv', chunksize=chunk_size)
total_age_50 = 0
for chunk in chunks:
    total_age_50 += (chunk['Age'] > 50).sum()
print(total_age_50)

72

In [6]:
#Найдите максимальное значение в колонке Fare по всему датасету. Используйте chunksize = 200
chunk_size = 200
chunks = pd.read_csv('titanic_s.csv', chunksize=chunk_size)
max_fare = 0
for chunk in chunks:
    chunk_max=chunk['Fare'].max()
    if chunk_max > max_fare:
        max_fare = chunk_max
print(max_fare)

512.3292

In [7]:
#Сколько пассажиров находилось в третьем классе (Pclass = 3)
chunk_size = 200
chunks = pd.read_csv('titanic_s.csv', chunksize=chunk_size)
count = 0
for chunk in chunks:
    filtered_chunk = chunk[(chunk['Pclass'] == 3)]
    count += len(filtered_chunk)
print(count)

487

Используя датасет ирисов, выполните следующие задания.
Сколько строк в датасете? 
 Сколько столбцов в датасете? 
 Какое среднее значение для столбца sepal_length?(3 знака после точки) 
 Какое минимальное значение для столбца sepal_width? 
 Какова медиана (50-й перцентиль) для столбца petal_length? 
 Какой стандартное отклонение для столбца petal_width?(3 знака после точки) 
 Сколько уникальных значений содержится в столбце class? 
 Какое наиболее частое значение в столбце class?

In [11]:
import kagglehub

# Download latest version
path = kagglehub.dataset_download("himanshunakrani/iris-dataset")

print("Path to dataset files:", path)

Path to dataset files: C:\Users\insom\.cache\kagglehub\datasets\himanshunakrani\iris-dataset\versions\1

In [9]:
df_iris = pd.read_csv('iris.csv')
df_iris.head()

   sepal_length  sepal_width  petal_length  petal_width species
0           5.1          3.5           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2  setosa

In [10]:
df_iris.describe()

       sepal_length  sepal_width  petal_length  petal_width
count    150.000000   150.000000    150.000000   150.000000
mean       5.843333     3.054000      3.758667     1.198667
std        0.828066     0.433594      1.764420     0.763161
min        4.300000     2.000000      1.000000     0.100000
25%        5.100000     2.800000      1.600000     0.300000
50%        5.800000     3.000000      4.350000     1.300000
75%        6.400000     3.300000      5.100000     1.800000
max        7.900000     4.400000      6.900000     2.500000

In [14]:
df_iris['species'].value_counts()

species
setosa        50
versicolor    50
virginica     50
Name: count, dtype: int64

У вас есть DataFrame с данными:

df = pd.DataFrame({'A': [1, 2, 3], 'B': ['4', '5', '6']})
Напишите код, который выполнит следующие шаги:

Преобразует значения в столбце 'B' в целые числа.
Найдет сумму значений столбцов 'A' и 'B' и выведет итоговую сумму.

In [8]:
import pandas as pd
df = pd.DataFrame({'A': [1, 2, 3], 'B': ['4', '5', '6']})
df['B'] = df['B'].astype(int)
sum = df.sum().sum()
print(sum)

21

У вас есть DataFrame с данными:
df = pd.DataFrame({'X': [10, 20, 30], 'Y': ['15', '25', '35']})
Напишите код, который выполнит следующие шаги:
Преобразует значения в столбце 'Y' в целые числа.
Создаст новый столбец 'Z', который будет содержать сумму значений столбцов 'X' и 'Y'.
Найдет максимальное значение в столбце 'Z'.

In [3]:
import pandas as pd
df = pd.DataFrame({'X': [10, 20, 30], 'Y': ['15', '25', '35']})
df['Y'] = df['Y'].astype(int)
df['Z'] = df['X'] + df['Y']
max_value = df['Z'].max()
print(max_value)

65